output/ignite-c-20-1000Mbps-3ms-20000-5000-4-load-1.out
[19:54:09][INFO ][Thread-5] Start Ignite client node.
[19:54:10][INFO ][Thread-5] 

>>>    __________  ________________  
>>>   /  _/ ___/ |/ /  _/_  __/ __/  
>>>  _/ // (7 7    // /  / / / _/    
>>> /___/\___/_/|_/___/ /_/ /___/   
>>> 
>>> ver. 2.7.0#20181130-sha1:256ae401
>>> 2018 Copyright(C) Apache Software Foundation
>>> 
>>> Ignite documentation: http://ignite.apache.org

[19:54:10][INFO ][Thread-5] Config URL: n/a
[19:54:10][INFO ][Thread-5] IgniteConfiguration [igniteInstanceName=YCSB client node, pubPoolSize=12, svcPoolSize=12, callbackPoolSize=12, stripedPoolSize=12, sysPoolSize=12, mgmtPoolSize=4, igfsPoolSize=12, dataStreamerPoolSize=12, utilityCachePoolSize=12, utilityCacheKeepAliveTime=60000, p2pPoolSize=2, qryPoolSize=12, igniteHome=null, igniteWorkDir=/tmp/ignite/work, mbeanSrv=com.sun.jmx.mbeanserver.JmxMBeanServer@710726a3, nodeId=d829fea8-c47c-4e47-b0ce-d5569143ccd5, marsh=BinaryMarshaller [], marshLocJobs=false, daemon=false, p2pEnabled=false, netTimeout=2000, sndRetryDelay=1000, sndRetryCnt=3, metricsHistSize=10000, metricsUpdateFreq=2000, metricsExpTime=9223372036854775807, discoSpi=TcpDiscoverySpi [addrRslvr=null, sockTimeout=0, ackTimeout=0, marsh=null, reconCnt=10, reconDelay=2000, maxAckTimeout=600000, forceSrvMode=false, clientReconnectDisabled=false, internalLsnr=null], segPlc=STOP, segResolveAttempts=2, waitForSegOnStart=true, allResolversPassReq=true, segChkFreq=10000, commSpi=TcpCommunicationSpi [connectGate=null, connPlc=org.apache.ignite.spi.communication.tcp.TcpCommunicationSpi$FirstConnectionPolicy@2dc72d08, enableForcibleNodeKill=false, enableTroubleshootingLog=false, locAddr=null, locHost=null, locPort=47100, locPortRange=100, shmemPort=-1, directBuf=true, directSndBuf=false, idleConnTimeout=600000, connTimeout=5000, maxConnTimeout=600000, reconCnt=10, sockSndBuf=32768, sockRcvBuf=32768, msgQueueLimit=0, slowClientQueueLimit=0, nioSrvr=null, shmemSrv=null, usePairedConnections=false, connectionsPerNode=1, tcpNoDelay=true, filterReachableAddresses=false, ackSndThreshold=32, unackedMsgsBufSize=0, sockWriteTimeout=2000, boundTcpPort=-1, boundTcpShmemPort=-1, selectorsCnt=6, selectorSpins=0, addrRslvr=null, ctxInitLatch=java.util.concurrent.CountDownLatch@6140ca7[Count = 1], stopping=false], evtSpi=org.apache.ignite.spi.eventstorage.NoopEventStorageSpi@764fdacc, colSpi=NoopCollisionSpi [], deploySpi=LocalDeploymentSpi [], indexingSpi=org.apache.ignite.spi.indexing.noop.NoopIndexingSpi@3f079762, addrRslvr=null, encryptionSpi=org.apache.ignite.spi.encryption.noop.NoopEncryptionSpi@7798da11, clientMode=true, rebalanceThreadPoolSize=1, txCfg=TransactionConfiguration [txSerEnabled=false, dfltIsolation=REPEATABLE_READ, dfltConcurrency=PESSIMISTIC, dfltTxTimeout=0, txTimeoutOnPartitionMapExchange=0, pessimisticTxLogSize=0, pessimisticTxLogLinger=10000, tmLookupClsName=null, txManagerFactory=null, useJtaSync=false], cacheSanityCheckEnabled=true, discoStartupDelay=60000, deployMode=SHARED, p2pMissedCacheSize=100, locHost=null, timeSrvPortBase=31100, timeSrvPortRange=100, failureDetectionTimeout=10000, sysWorkerBlockedTimeout=null, clientFailureDetectionTimeout=30000, metricsLogFreq=60000, hadoopCfg=null, connectorCfg=ConnectorConfiguration [jettyPath=null, host=null, port=11211, noDelay=true, directBuf=false, sndBufSize=32768, rcvBufSize=32768, idleQryCurTimeout=600000, idleQryCurCheckFreq=60000, sndQueueLimit=0, selectorCnt=4, idleTimeout=7000, sslEnabled=false, sslClientAuth=false, sslCtxFactory=null, sslFactory=null, portRange=100, threadPoolSize=12, msgInterceptor=null], odbcCfg=null, warmupClos=null, atomicCfg=AtomicConfiguration [seqReserveSize=1000, cacheMode=PARTITIONED, backups=1, aff=null, grpName=null], classLdr=null, sslCtxFactory=null, platformCfg=null, binaryCfg=null, memCfg=null, pstCfg=null, dsCfg=null, activeOnStart=true, autoActivation=true, longQryWarnTimeout=3000, sqlConnCfg=null, cliConnCfg=ClientConnectorConfiguration [host=null, port=10800, portRange=100, sockSndBufSize=0, sockRcvBufSize=0, tcpNoDelay=true, maxOpenCursorsPerConn=128, threadPoolSize=12, idleTimeout=0, jdbcEnabled=true, odbcEnabled=true, thinCliEnabled=true, sslEnabled=false, useIgniteSslCtxFactory=true, sslClientAuth=false, sslCtxFactory=null], mvccVacuumThreadCnt=2, mvccVacuumFreq=5000, authEnabled=false, failureHnd=null, commFailureRslvr=null]
[19:54:10][INFO ][Thread-5] Daemon mode: off
[19:54:10][INFO ][Thread-5] OS: Linux 4.9.0-11-amd64 amd64
[19:54:10][INFO ][Thread-5] OS user: root
[19:54:10][INFO ][Thread-5] PID: 480
[19:54:10][INFO ][Thread-5] Language runtime: Java Platform API Specification ver. 1.8
[19:54:10][INFO ][Thread-5] VM information: OpenJDK Runtime Environment 1.8.0_282-b08 Oracle Corporation OpenJDK 64-Bit Server VM 25.282-b08
[19:54:10][INFO ][Thread-5] VM total memory: 14.0GB
[19:54:10][INFO ][Thread-5] Remote Management [restart: off, REST: off, JMX (remote: off)]
[19:54:10][INFO ][Thread-5] Logger: Log4J2Logger [quiet=false, config=file:/opt/ycsb-0.17.0/ignite-binding/lib/ignite-binding-0.17.0.jar!/log4j2.xml]
[19:54:10][INFO ][Thread-5] IGNITE_HOME=null
[19:54:10][INFO ][Thread-5] VM arguments: []
[19:54:10][INFO ][Thread-5] Configured caches [in 'sysMemPlc' dataRegion: ['ignite-sys-cache']]
[19:54:10][WARN ][Thread-5] Please set system property '-Djava.net.preferIPv4Stack=true' to avoid possible problems in mixed environments.
[19:54:10][INFO ][Thread-5] Configured plugins:
[19:54:10][INFO ][Thread-5]   ^-- None
[19:54:10][INFO ][Thread-5] 
[19:54:10][INFO ][Thread-5] Configured failure handler: [hnd=StopNodeOrHaltFailureHandler [tryStop=false, timeout=0, super=AbstractFailureHandler [ignoredFailureTypes=[SYSTEM_WORKER_BLOCKED]]]]
[19:54:10][INFO ][Thread-5] Successfully bound communication NIO server to TCP port [port=47100, locHost=0.0.0.0/0.0.0.0, selectorsCnt=6, selectorSpins=0, pairedConn=false]
[19:54:10][WARN ][Thread-5] Message queue limit is set to 0 which may lead to potential OOMEs when running cache operations in FULL_ASYNC or PRIMARY_SYNC modes due to message queues growth on sender and receiver sides.
[19:54:10][WARN ][Thread-5] Checkpoints are disabled (to enable configure any GridCheckpointSpi implementation)
[19:54:10][WARN ][Thread-5] Collision resolution is disabled (all jobs will be activated upon arrival).
[19:54:10][INFO ][Thread-5] Security status [authentication=off, tls/ssl=off]
[19:54:10][INFO ][Thread-5] Evict partition permits=3
[19:54:11][INFO ][Thread-5] Client connector processor has started on TCP port 10800
[19:54:11][INFO ][Thread-5] REST protocols do not start on client node. To start the protocols on client node set '-DIGNITE_REST_START_ON_CLIENT=true' system property.
[19:54:11][INFO ][Thread-5] Non-loopback local IPs: 172.20.0.10
[19:54:11][INFO ][Thread-5] Enabled local MACs: 0242AC14000A
[19:54:11][INFO ][disco-notifier-worker-#46%YCSB client node%] Assigned mvcc coordinator [crd=MvccCoordinator [nodeId=8b6b3576-0778-4b0d-bae8-3d73cb0bdaa5, crdVer=1614109552213, topVer=AffinityTopologyVersion [topVer=29, minorTopVer=0]], crdNode=TcpDiscoveryNode [id=8b6b3576-0778-4b0d-bae8-3d73cb0bdaa5, addrs=[127.0.0.1, 172.20.0.20], sockAddrs=[bbf2368655c8/172.20.0.20:47500, /127.0.0.1:47500], discPort=47500, order=1, intOrder=1, lastExchangeTime=1614110051540, loc=false, ver=2.7.0#20181130-sha1:256ae401, isClient=false]]
[19:54:11][INFO ][exchange-worker-#48%YCSB client node%] Started exchange init [topVer=AffinityTopologyVersion [topVer=29, minorTopVer=0], mvccCrd=MvccCoordinator [nodeId=8b6b3576-0778-4b0d-bae8-3d73cb0bdaa5, crdVer=1614109552213, topVer=AffinityTopologyVersion [topVer=29, minorTopVer=0]], mvccCrdChange=true, crd=false, evt=NODE_JOINED, evtNode=d829fea8-c47c-4e47-b0ce-d5569143ccd5, customEvt=null, allowMerge=true]
[19:54:11][INFO ][exchange-worker-#48%YCSB client node%] Components activation performed in 0 ms.
[19:54:12][INFO ][exchange-worker-#48%YCSB client node%] Started cache [name=ignite-sys-cache, id=-2100569601, memoryPolicyName=sysMemPlc, mode=REPLICATED, atomicity=TRANSACTIONAL, backups=2147483647, mvcc=false], encryptionEnabled=false]
[19:54:12][INFO ][exchange-worker-#48%YCSB client node%] Starting caches on local join performed in 178 ms.
[19:54:12][INFO ][grid-nio-worker-tcp-comm-0-#32%YCSB client node%] Established outgoing communication connection [locAddr=/172.20.0.10:59842, rmtAddr=bbf2368655c8/172.20.0.20:47100]
[19:54:12][INFO ][exchange-worker-#48%YCSB client node%] Sending Single Message performed in 26 ms.
[19:54:12][INFO ][exchange-worker-#48%YCSB client node%] Finished exchange init [topVer=AffinityTopologyVersion [topVer=29, minorTopVer=0], crd=false]
[19:54:12][INFO ][sys-#49%YCSB client node%] Received full message, will finish exchange [node=8b6b3576-0778-4b0d-bae8-3d73cb0bdaa5, resVer=AffinityTopologyVersion [topVer=29, minorTopVer=0]]
[19:54:12][INFO ][sys-#49%YCSB client node%] Affinity initialization on local join performed in 13 ms.
[19:54:12][INFO ][sys-#49%YCSB client node%] Affinity changes applied in 13 ms.
[19:54:12][INFO ][sys-#49%YCSB client node%] Full map updating for 2 groups performed in 3 ms.
[19:54:12][INFO ][sys-#49%YCSB client node%] Finish exchange future [startVer=AffinityTopologyVersion [topVer=29, minorTopVer=0], resVer=AffinityTopologyVersion [topVer=29, minorTopVer=0], err=null]
[19:54:12][INFO ][sys-#49%YCSB client node%] Finish proxy initialization, cacheName=ignite-sys-cache, localNodeId=d829fea8-c47c-4e47-b0ce-d5569143ccd5
[19:54:12][INFO ][sys-#49%YCSB client node%] Completed partition exchange [localNode=d829fea8-c47c-4e47-b0ce-d5569143ccd5, exchange=GridDhtPartitionsExchangeFuture [topVer=AffinityTopologyVersion [topVer=29, minorTopVer=0], evt=NODE_JOINED, evtNode=TcpDiscoveryNode [id=d829fea8-c47c-4e47-b0ce-d5569143ccd5, addrs=[127.0.0.1, 172.20.0.10], sockAddrs=[/127.0.0.1:0, bfbce60d7393/172.20.0.10:0], discPort=0, order=29, intOrder=0, lastExchangeTime=1614110051429, loc=true, ver=2.7.0#20181130-sha1:256ae401, isClient=true], done=true], topVer=AffinityTopologyVersion [topVer=29, minorTopVer=0], durationFromInit=323]
[19:54:12][INFO ][exchange-worker-#48%YCSB client node%] Skipping rebalancing (no affinity changes) [top=AffinityTopologyVersion [topVer=29, minorTopVer=0], rebTopVer=AffinityTopologyVersion [topVer=-1, minorTopVer=0], evt=NODE_JOINED, evtNode=d829fea8-c47c-4e47-b0ce-d5569143ccd5, client=true]
[19:54:12][INFO ][grid-nio-worker-tcp-comm-1-#33%YCSB client node%] Established outgoing communication connection [locAddr=/172.20.0.10:34898, rmtAddr=3a3437eca01f/172.20.0.3:47100]
[19:54:12][INFO ][Thread-5] Performance suggestions for grid 'YCSB client node' (fix if possible)
[19:54:12][INFO ][Thread-5] To disable, set -DIGNITE_PERFORMANCE_SUGGESTIONS_DISABLED=true
[19:54:12][INFO ][Thread-5]   ^-- Enable G1 Garbage Collector (add '-XX:+UseG1GC' to JVM options)
[19:54:12][INFO ][Thread-5]   ^-- Specify JVM heap max size (add '-Xmx<size>[g|G|m|M|k|K]' to JVM options)
[19:54:12][INFO ][Thread-5]   ^-- Set max direct memory size if getting 'OOME: Direct buffer memory' (add '-XX:MaxDirectMemorySize=<size>[g|G|m|M|k|K]' to JVM options)
[19:54:12][INFO ][Thread-5]   ^-- Disable processing of calls to System.gc() (add '-XX:+DisableExplicitGC' to JVM options)
[19:54:12][INFO ][Thread-5] Refer to this page for more performance suggestions: https://apacheignite.readme.io/docs/jvm-and-system-tuning
[19:54:12][INFO ][Thread-5] 
[19:54:12][INFO ][Thread-5] To start Console Management & Monitoring run ignitevisorcmd.{sh|bat}
[19:54:12][INFO ][Thread-5] 

>>> +----------------------------------------------------------------------+
>>> Ignite ver. 2.7.0#20181130-sha1:256ae4012cb143b4855b598b740a6f3499ead4db
>>> +----------------------------------------------------------------------+
>>> OS name: Linux 4.9.0-11-amd64 amd64
>>> CPU(s): 12
>>> Heap: 14.0GB
>>> VM name: 480@bfbce60d7393
>>> Ignite instance name: YCSB client node
>>> Local node [ID=D829FEA8-C47C-4E47-B0CE-D5569143CCD5, order=29, clientMode=true]
>>> Local node addresses: [bfbce60d7393/127.0.0.1, /172.20.0.10]
>>> Local ports: TCP:10800 TCP:47100 

[19:54:12][INFO ][Thread-5] Topology snapshot [ver=29, locNode=d829fea8, servers=20, clients=1, state=ACTIVE, CPUs=252, offheap=250.0GB, heap=34.0GB]
[19:54:12][INFO ][Thread-5] Activate Ignite cluster.
[19:54:12][INFO ][Thread-5] Sending activate request from node [id=d829fea8-c47c-4e47-b0ce-d5569143ccd5, topVer=AffinityTopologyVersion [topVer=29, minorTopVer=0], client=true, daemon=false]
[19:54:12][INFO ][grid-nio-worker-tcp-comm-2-#34%YCSB client node%] Established outgoing communication connection [locAddr=/172.20.0.10:59914, rmtAddr=823c56bd18cc/172.20.0.8:47100]
[19:54:12][INFO ][exchange-worker-#48%YCSB client node%] Started cache [name=usertable, id=358348515, memoryPolicyName=null, mode=PARTITIONED, atomicity=ATOMIC, backups=1, mvcc=false], encryptionEnabled=false]
[19:54:12][INFO ][grid-nio-worker-tcp-comm-3-#35%YCSB client node%] Established outgoing communication connection [locAddr=/172.20.0.10:56792, rmtAddr=cf785339e310/172.20.0.11:47100]
[19:54:12][INFO ][exchange-worker-#48%YCSB client node%] Finish proxy initialization, cacheName=usertable, localNodeId=d829fea8-c47c-4e47-b0ce-d5569143ccd5
[19:54:12][INFO ][grid-nio-worker-tcp-comm-4-#36%YCSB client node%] Established outgoing communication connection [locAddr=/172.20.0.10:50804, rmtAddr=9554cac54c2e/172.20.0.22:47100]
[19:54:12][INFO ][grid-nio-worker-tcp-comm-5-#37%YCSB client node%] Accepted incoming communication connection [locAddr=/172.20.0.10:47100, rmtAddr=/172.20.0.4:60410]
[19:54:12][INFO ][grid-nio-worker-tcp-comm-0-#32%YCSB client node%] Accepted incoming communication connection [locAddr=/172.20.0.10:47100, rmtAddr=/172.20.0.16:46786]
[19:54:12][INFO ][grid-nio-worker-tcp-comm-2-#34%YCSB client node%] Accepted incoming communication connection [locAddr=/172.20.0.10:47100, rmtAddr=/172.20.0.6:42100]
[19:54:12][INFO ][grid-nio-worker-tcp-comm-1-#33%YCSB client node%] Established outgoing communication connection [locAddr=/172.20.0.10:53970, rmtAddr=9576b4a78b4b/172.20.0.15:47100]
[19:54:12][INFO ][grid-nio-worker-tcp-comm-3-#35%YCSB client node%] Accepted incoming communication connection [locAddr=/172.20.0.10:47100, rmtAddr=/172.20.0.12:37952]
[19:54:12][INFO ][grid-nio-worker-tcp-comm-4-#36%YCSB client node%] Accepted incoming communication connection [locAddr=/172.20.0.10:47100, rmtAddr=/172.20.0.19:54482]
[19:54:12][INFO ][grid-nio-worker-tcp-comm-5-#37%YCSB client node%] Accepted incoming communication connection [locAddr=/172.20.0.10:47100, rmtAddr=/172.20.0.14:34494]
[19:54:12][INFO ][grid-nio-worker-tcp-comm-0-#32%YCSB client node%] Accepted incoming communication connection [locAddr=/172.20.0.10:47100, rmtAddr=/172.20.0.2:48372]
[19:54:12][INFO ][grid-nio-worker-tcp-comm-1-#33%YCSB client node%] Established outgoing communication connection [locAddr=/172.20.0.10:35738, rmtAddr=dc4b48bac200/172.20.0.9:47100]
[19:54:12][INFO ][grid-nio-worker-tcp-comm-2-#34%YCSB client node%] Accepted incoming communication connection [locAddr=/172.20.0.10:47100, rmtAddr=/172.20.0.5:33490]
[19:54:12][INFO ][grid-nio-worker-tcp-comm-3-#35%YCSB client node%] Established outgoing communication connection [locAddr=/172.20.0.10:34642, rmtAddr=87f2f29efede/172.20.0.21:47100]
[19:54:12][INFO ][grid-nio-worker-tcp-comm-4-#36%YCSB client node%] Established outgoing communication connection [locAddr=/172.20.0.10:48082, rmtAddr=2ca8e016d104/172.20.0.13:47100]
[19:54:12][INFO ][grid-nio-worker-tcp-comm-5-#37%YCSB client node%] Accepted incoming communication connection [locAddr=/172.20.0.10:47100, rmtAddr=/172.20.0.7:56408]
[19:54:12][INFO ][grid-nio-worker-tcp-comm-0-#32%YCSB client node%] Established outgoing communication connection [locAddr=/172.20.0.10:38228, rmtAddr=f38253157a23/172.20.0.18:47100]
[19:54:12][INFO ][grid-nio-worker-tcp-comm-1-#33%YCSB client node%] Established outgoing communication connection [locAddr=/172.20.0.10:38440, rmtAddr=806cf6f254a9/172.20.0.17:47100]
[19:54:21][WARN ][ignite-update-notifier-timer] New version is available at ignite.apache.org: 2.9.1
[19:54:22][INFO ][Thread-3] Stopped cache [cacheName=ignite-sys-cache]
[19:54:22][INFO ][Thread-3] Stopped cache [cacheName=usertable]
[19:54:22][INFO ][Thread-3] 

>>> +---------------------------------------------------------------------------------+
>>> Ignite ver. 2.7.0#20181130-sha1:256ae4012cb143b4855b598b740a6f3499ead4db stopped OK
>>> +---------------------------------------------------------------------------------+
>>> Ignite instance name: YCSB client node
>>> Grid uptime: 00:00:10.047


[OVERALL], RunTime(ms), 12617
[OVERALL], Throughput(ops/sec), 396.29071887136405
[TOTAL_GCS_PS_Scavenge], Count, 3
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 27
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.21399698819053659
[TOTAL_GCS_PS_MarkSweep], Count, 2
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 64
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.5072521201553459
[TOTAL_GCs], Count, 5
[TOTAL_GC_TIME], Time(ms), 91
[TOTAL_GC_TIME_%], Time(%), 0.7212491083458825
[CLEANUP], Operations, 4
[CLEANUP], AverageLatency(us), 27600.75
[CLEANUP], MinLatency(us), 9
[CLEANUP], MaxLatency(us), 110399
[CLEANUP], 95thPercentileLatency(us), 110399
[CLEANUP], 99thPercentileLatency(us), 110399
[INSERT], Operations, 5000
[INSERT], AverageLatency(us), 7736.2004
[INSERT], MinLatency(us), 6848
[INSERT], MaxLatency(us), 236799
[INSERT], 95thPercentileLatency(us), 8095
[INSERT], 99thPercentileLatency(us), 8823
[INSERT], Return=OK, 5000